In [29]:
import pandas as pd
import numpy as np

In [30]:
s = pd.Series([1,2,3,4], index = ["a", "b", "c", "d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [31]:
s2 = s.reindex(["b", "c", "a", "b"])
s2

b    2
c    3
a    1
b    2
dtype: int64

In [32]:
s3 = pd.Series(["blue", "yellow", "red"], index = [0,2,4])
s3

0      blue
2    yellow
4       red
dtype: object

In [33]:
df = pd.DataFrame(np.arange(9).reshape(3,3), index = ["a", "b", "c"], columns=["Tim", "Tom", "Kate"])
df

   Tim  Tom  Kate
a    0    1     2
b    3    4     5
c    6    7     8

In [34]:
df.reindex(columns=["Tom", "Tim", "Kate"])

   Tom  Tim  Kate
a    1    0     2
b    4    3     5
c    7    6     8

In [36]:
df.loc['a']

Tim     0
Tom     1
Kate    2
Name: a, dtype: int64

In [37]:
s = pd.Series(np.arange(5), index = ["a", "b", "c", "d", "e"])
s

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [38]:
new_s = s.drop('a')

In [39]:
new_s

b    1
c    2
d    3
e    4
dtype: int64

In [40]:
s.drop(['c', 'd'])

a    0
b    1
e    4
dtype: int64

In [41]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ["Kate", "Tim", "Tom", "Alex"], columns = list('ABCD'))
data

       A   B   C   D
Kate   0   1   2   3
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [42]:
data.drop(['Kate', 'Tim'])

       A   B   C   D
Tom    8   9  10  11
Alex  12  13  14  15

In [43]:
data.drop(['A'], axis = 1)

       B   C   D
Kate   1   2   3
Tim    5   6   7
Tom    9  10  11
Alex  13  14  15

In [48]:
index = data.sum(axis = 0).idxmax()
index

'D'

In [49]:
data

       A   B   C   D
Kate   0   1   2   3
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [50]:
data.mean(axis = 'index')

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

In [51]:
data.mean(axis = "columns")

Kate     1.5
Tim      5.5
Tom      9.5
Alex    13.5
dtype: float64